Revit 2024 API
BuiltInFailures.FabricFailures.CannotPlaceFabricAreaWarn Property
 Can't find a host for Fabric Area.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotPlaceFabricAreaWarn { get; }
Visual Basic
Public Shared ReadOnly Property CannotPlaceFabricAreaWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotPlaceFabricAreaWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace